from colorama import*
import os, sys, time


def banner(value):
  for x in value + '\n':
    sys.stdout.write(x)
    sys.stdout.flush()
    time.sleep(0.003)

start = """
\033[1;34m───────────\033[1;32m▒▒▒▒▒▒\033[1;34m────────\033[1;33m▄████▄
\033[1;34m──────────\033[1;32m▒\033[1;37m─▄\033[1;32m▒\033[1;37m─▄\033[1;32m▒\033[1;34m───────\033[1;33m███▄█▀
\033[1;34m──────────\033[1;32m▒▒▒▒▒▒▒\033[1;34m──────\033[1;33m▐████\033[1;31m   ██   ██
\033[1;34m──────────\033[1;32m▒▒▒▒▒▒▒\033[1;34m───────\033[1;33m█████▄
\033[1;34m──────────\033[1;32m▒\033[1;34m─\033[1;32m▒\033[1;34m─\033[1;32m▒\033[1;34m─\033[1;32m▒\033[1;34m────────\033[1;33m▀████▀
\033[1;36m         ____
        | __ )  __ _ _ __  _ __   ___ _ __ ___
        |  _ \ / _` | '_ \| '_ \ / _ \ '__/ __| 
        | |_) | (_| | | | | | | |  __/ |  \__ \ 
        |____/ \__,_|_| |_|_| |_|\___|_|  |___/ \033[1;31mv1.0 
\033[1;35m
         ╔══════════════════════════════════╗
         ║                                  ║
         ║\033[1;33m      𝐂𝐫𝐞𝐚𝐭𝐞𝐝 𝐛𝐲 𝐒𝟒𝐯𝐢𝐭𝐚𝐫\033[1;35m          ║
         ║\033[1;33m      𝐁𝐚𝐧𝐧𝐞𝐫 𝐟𝐨𝐫 𝐓𝐞𝐫𝐦𝐮𝐱\033[1;35m           ║
         ║                                  ║
\033[1;32m         ╠══════════════════════════════════╣
         ║                                  ║
         ║\033[1;33m        𝐒𝐞𝐥𝐞𝐜𝐭 𝐚𝐧 𝐨𝐩𝐭𝐢𝐨𝐧\033[1;32m          ║
         ║                                  ║
         ╠═\033[1;31m▶\033[1;37m 1.𝐊𝐚𝐥𝐢 𝐋𝐢𝐧𝐮𝐱                   \033[1;32m║
         ║                                  ║
         ║                                  ║
         ╠═\033[1;31m▶\033[1;37m 2.𝐋𝐢𝐧𝐮𝐱                        \033[1;32m║
         ║                                  ║
         ║                                  ║
         ╠═\033[1;31m▶\033[1;37m 3.𝐁𝐚𝐬𝐡                         \033[1;32m║
         ║                                  ║
         ║                                  ║
         ╠═\033[1;31m▶\033[1;37m 4.𝐍𝐢𝐧𝐣𝐚                        \033[1;32m║
         ║                                  ║
         ║                                  ║
         ╠═\033[1;31m▶\033[1;37m 5.𝐌𝐞𝐭𝐚𝐬𝐩𝐥𝐨𝐢𝐭                   \033[1;32m║
         ║                                  ║\033[1;37m"""

def run():
  os.system("clear")
  banner(start)
  while(True):
    try:
      options = int(input("\033[1;32m         ╚═"+Fore.CYAN+">_ "))

      if options == 1:
        print("Esto es Kali Linux")
        break
      elif options == 2:
        print("Esto es Linux")
        break
      elif options == 3:
        print("Esto es Bash")
        break
      elif options == 4:
        print("Esto es un Ninja")
        break
      elif options == 5:
        print("Esto es Metasploit")
        break
      else:
        print("""\033[1;32m         ║                                  ║
         ║\033[1;36mAmigo, debes de elegir una opción \033[1;32m║
\033[1;32m         ║                                  ║""")
    except:
      print("""\033[1;32m         ║                                  ║
         ║\033[1;36mAmigo, debes de elegir una opción \033[1;32m║
\033[1;32m         ║                                  ║""")


run()
